Repository: huixiangyang/arc-kit
Catalog: Sources/Features/Window/Domain/Resources/Localization/Window.xcstrings
Source language: en
Languages: zh_hans

# appRules.bundleIDRequired
source: Cannot add an excluded app without an app name and Bundle ID
zh_hans: 无法添加排除 App：应用名称或 Bundle ID 为空

# appRules.emptyBundleID
source: Excluded window app bundleIdentifier cannot be empty or have leading or trailing whitespace
zh_hans: 窗口排除 App bundleIdentifier 不能为空或包含首尾空白

# appRules.emptyName
source: Excluded window app name cannot be empty or have leading or trailing whitespace
zh_hans: 窗口排除 App 名称不能为空或包含首尾空白

# appRules.selfExclusionRejected
source: Arc Kit cannot be added to its own window exclusion list
zh_hans: 不能把 Arc Kit 自己加入窗口管理排除列表

# layout.available.display.detected.missing
source: No available display detected
zh_hans: 未检测到可用显示器

# layout.bottom.half
source: Bottom Half
zh_hans: 下半屏

# layout.bottom.left
source: Bottom Left
zh_hans: 左下角

# layout.bottom.right
source: Bottom Right
zh_hans: 右下角

# layout.center
source: Center
zh_hans: 居中

# layout.connect.second.display
source: Connect a second display
zh_hans: 需要连接第二台显示器

# layout.display.position
source: By Display Position
zh_hans: 按屏幕位置

# layout.fullScreen.display
source: Full-screen display
zh_hans: 全屏显示

# layout.left.half
source: Left Half
zh_hans: 左半屏

# layout.left.third
source: Left Third
zh_hans: 左三分之一

# layout.left.two.thirds
source: Left Two Thirds
zh_hans: 左三分之二

# layout.maximize
source: Maximize
zh_hans: 铺满

# layout.middle.third
source: Middle Third
zh_hans: 中三分之一

# layout.move.next.display
source: Move to Next Display
zh_hans: 移到下一显示器

# layout.move.previous.display
source: Move to Previous Display
zh_hans: 移到上一显示器

# layout.restore.previous.position
source: Restore Previous Position
zh_hans: 恢复上次位置

# layout.right.half
source: Right Half
zh_hans: 右半屏

# layout.right.third
source: Right Third
zh_hans: 右三分之一

# layout.right.two.thirds
source: Right Two Thirds
zh_hans: 右三分之二

# layout.stageManager
source: Stage Manager
zh_hans: 台前调度

# layout.system.order
source: By System Order
zh_hans: 按系统顺序

# layout.top.half
source: Top Half
zh_hans: 上半屏

# layout.top.left
source: Top Left
zh_hans: 左上角

# layout.top.right
source: Top Right
zh_hans: 右上角

# scene.match.application
source: Only window of this app
zh_hans: 该应用的唯一窗口

# scene.match.contains
source: Window title contains
zh_hans: 窗口标题包含

# scene.match.exact
source: Exact window title
zh_hans: 窗口标题完全匹配

# scene.result.ambiguousWindow
source: Multiple windows match; choose a window
zh_hans: 匹配到多个窗口，请重新指定

# scene.result.applied
source: Restored
zh_hans: 已恢复

# scene.result.conflictingAssignment
source: Several entries match the same window
zh_hans: 多个条目匹配到同一窗口

# scene.result.constrained
source: Window size or position is constrained
zh_hans: 窗口尺寸或位置受限

# scene.result.excludedApplication
source: App is excluded from window management
zh_hans: 应用已被窗口管理排除

# scene.result.failed
source: Could not restore window
zh_hans: 无法恢复窗口

# scene.result.missingDisplay
source: Display is disconnected
zh_hans: 显示器未连接

# scene.result.missingWindow
source: Window not found
zh_hans: 未找到窗口

# scene.result.unavailable
source: Window is unavailable on this desktop
zh_hans: 当前桌面无法管理此窗口

# scene.result.unchanged
source: Already in place
zh_hans: 已在目标位置

# scene.validation.display
source: The scene refers to an invalid or missing saved display.
zh_hans: 场景引用了无效或未保存的显示器。

# scene.validation.empty
source: A scene needs at least one display and one window.
zh_hans: 场景至少需要一个显示器和一个窗口。

# scene.validation.entry
source: A window entry has an invalid app identity or matching rule.
zh_hans: 窗口条目的应用身份或匹配规则无效。

# scene.validation.entryLimit
source: A scene supports up to 24 windows and displays.
zh_hans: 每个场景最多保存 24 个窗口和显示器。

# scene.validation.focus
source: The focus window must belong to this scene.
zh_hans: 聚焦窗口必须属于当前场景。

# scene.validation.geometry
source: Window geometry must be finite, partly visible, and no larger than four times the display’s usable size.
zh_hans: 窗口坐标必须为有限值，窗口需至少部分可见且尺寸不得超过显示器可用区域的四倍。

# scene.validation.identity
source: Scene, display, or window identities must not repeat.
zh_hans: 场景、显示器或窗口标识不能重复。

# scene.validation.name
source: Enter a scene name of 1–80 characters without surrounding whitespace.
zh_hans: 场景名称需为 1–80 个字符，不能包含首尾空白。

# scene.validation.sceneLimit
source: You can save up to 64 window scenes.
zh_hans: 最多可保存 64 个窗口场景。

# scene.validation.shortcut
source: Use a valid key with Control, Option, or Command for the scene shortcut.
zh_hans: 场景快捷键需使用有效按键，并包含 Control、Option 或 Command。

# shortcut.window.shortcut.display.value.one
source: Window shortcut display value must be one printable key or an explicit special key name
zh_hans: 窗口快捷键显示值必须是单个可显示按键或明确的特殊键名

# shortcut.window.shortcut.keycode.outside.supported
source: Window shortcut keyCode is outside the supported macOS virtual key range
zh_hans: 窗口快捷键 keyCode 超出当前支持的 macOS 虚拟键码范围

# shortcut.window.shortcut.modifier.contains.unknown.bits
source: Window shortcut modifier contains unknown bits
zh_hans: 窗口快捷键修饰键包含未知位

# validation.each.window.action.one
source: Each window action can have only one shortcut
zh_hans: 每个窗口动作只能配置一个快捷键

# validation.excluded.window.app.bundleIDs
source: Excluded window app bundle identifiers must be unique
zh_hans: 窗口排除 App bundleIdentifier 不能重复

# validation.excluded.window.app.names.bundleIDs
source: Excluded window app names and bundle identifiers cannot have leading or trailing whitespace
zh_hans: 窗口排除 App 名称和 bundleIdentifier 不得包含首尾空白

# validation.excluded.window.apps.require.nonempty.name
source: Excluded window apps require a nonempty name and bundleIdentifier
zh_hans: 窗口排除 App 必须包含非空名称和 bundleIdentifier

# validation.selfExclusionRejected
source: Arc Kit cannot be excluded from its own window management
zh_hans: 窗口排除 App 不允许包含 Arc Kit 自身

# validation.window.spacing.outside.current.schema
source: Window spacing is outside the current schema's range
zh_hans: 窗口间距超出当前 schema 允许范围
